#Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'ord_no':[70001,70009,70002,70004,70007,70005,70008],'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760],'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10'],'customer_id':[3005,3001,3002,3009,3005,3007,3002],'salesman_id': [5002,5005,5001,5003,5002,5001,5001]})

In [3]:
df

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3005         5002
1   70009     270.65  2012-09-10         3001         5005
2   70002      65.26  2012-10-05         3002         5001
3   70004     110.50  2012-08-17         3009         5003
4   70007     948.50  2012-09-10         3005         5002
5   70005    2400.60  2012-07-27         3007         5001
6   70008    5760.00  2012-09-10         3002         5001

In [4]:
df1 = df.groupby('customer_id').agg({'purch_amt': ['mean', 'min', 'max']})

In [5]:
df1

            purch_amt
                 mean      min      max
customer_id
3001           270.65   270.65   270.65
3002          2912.63    65.26  5760.00
3005           549.50   150.50   948.50
3007          2400.60  2400.60  2400.60
3009           110.50   110.50   110.50